quanguoheme/hdx_1.1/drivers/max3255X/include/dev/mml_uart_regs.h
/*
 * mml_uart_regs.h --
 *
 * ----------------------------------------------------------------------------
 * Copyright (c) 2014, Maxim Integrated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *     * Redistributions of source code must retain the above copyright
 *       notice, this list of conditions and the following disclaimer.
 *     * Redistributions in binary form must reproduce the above copyright
 *       notice, this list of conditions and the following disclaimer in the
 *       documentation and/or other materials provided with the distribution.
 *     * Neither the name of the <organization> nor the
 *       names of its contributors may be used to endorse or promote products
 *       derived from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY MAXIM INTEGRATED ''AS IS'' AND ANY
 * EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL MAXIM INTEGRATED BE LIABLE FOR ANY
 * DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND
 * ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/* [INTERNAL] ------------------------------------------------------------------
 * Created on: Jun 13, 2014
 * Author: Yann G. <yann.gaude@maximintegrated.com>
 *
 * ---- Subversion keywords (need to set the keyword property)
 * $Revision:: $: Revision of last commit
 * $Author:: $: Author of last commit
 * $Date:: $: Date of last commit
 * [/INTERNAL] -------------------------------------------------------------- */

#ifndef _MML_UART_REGS_H_
#define _MML_UART_REGS_H_

/** @file mml_uart_regs.h UART Registers Header */

/** @defgroup MML_UART UART Driver */

/** @defgroup MML_UART_REGS UART Registers
 *
 * @note UART IP or Specification version number
 *
 * @ingroup MML_UART
 * @{
 */

/** @defgroup MML_UART_REGS_CR Control Register (CR)
 *
 * @li RXTHD [3:0]	- R/W: receive FIFO threshold
 * @li PAREN [4] 	- R/W: parity enable
 * @li PAREO [5]	- R/W: parity mode (odd or even)
 * @li PARMD [6]	- R/W: parity mode
 * @li RFU1 [7]		- R: reserved
 * @li TXFLUSH [8]	- R/W: flush transmit FIFO, clear by hw
 * @li RXFLUSH [9]	- R/W: flush receive FIFO , clear by hw
 * @li SIZE [11:10] - R/W: data format, number of bits per data
 * @li STOP [12]	- R/W: number of stop bits
 * @li RTSCTS [13]	- R/W: hardware flow control enable
 * @li RFU2 [31:14]	- R: reserved
 *
 * @{
 */
#define MML_UART_CR_OFST						0x00000000 //!< Register offset
#define MML_UART_CR_DFLT						0x00000000 //!< Register default value

/** Bits Fields */
#define MML_UART_CR_RXTHD_OFST					0 //!< RXTHD offset
#define MML_UART_CR_RXTHD_MASK_NOOSFT			0xf //!< RXTHD mask
#define MML_UART_CR_RXTHD_MASK					( MML_UART_CR_RXTHD_MASK_NOOSFT << MML_UART_CR_RXTHD_OFST ) //!< RXTHD mask

#define MML_UART_CR_PAREN_OFST					4 //!< PAREN offset
#define MML_UART_CR_PAREN_MASK_NOOFST			0x1 //!< PAREN mask no offset
#define MML_UART_CR_PAREN_MASK					( MML_UART_CR_PAREN_MASK_NOOFST << MML_UART_CR_PAREN_OFST ) //!< PAREN mask

#define MML_UART_CR_PAREO_OFST					5 //!< PAREO offset
#define MML_UART_CR_PAREO_MASK_NOOFST			0x1 //!< PAREO mask no offset
#define MML_UART_CR_PAREO_MASK					( MML_UART_CR_PAREO_MASK_NOOFST << MML_UART_CR_PAREO_OFST ) //!< PAREO mask

#define MML_UART_CR_PARMD_OFST					6 //!< PARMD offset
#define MML_UART_CR_PARMD_MASK_NOOFST			0x1 //!< PARMD mask no offset
#define MML_UART_CR_PARMD_MASK					( MML_UART_CR_PARMD_MASK_NOOFST << MML_UART_CR_PARMD_OFST ) //!< PARMD mask

#define MML_UART_CR_RFU1_OFST					7 //!< RFU1 offset
#define MML_UART_CR_RFU1_MASK_NOOFST			0x1 //!< RFU1 mask no offset
#define MML_UART_CR_RFU1_MASK					( MML_UART_CR_RFU1_MASK_NOOFST << MML_UART_CR_RFU1_OFST )0x80 //!< RFU1 mask

#define MML_UART_CR_TXFLUSH_OFST				8 //!< TXFLUSH offset
#define MML_UART_CR_TXFLUSH_MASK_NOOFST			0x1 //!< TXFLUSH mask no offset
#define MML_UART_CR_TXFLUSH_MASK				( MML_UART_CR_TXFLUSH_MASK_NOOFST << MML_UART_CR_TXFLUSH_OFST ) //!< TXFLUSH mask

#define MML_UART_CR_RXFLUSH_OFST				9 //!< RXFLUSH offset
#define MML_UART_CR_RXFLUSH_MASK_NOOFST			0x1 //!< RXFLUSH mask no offset
#define MML_UART_CR_RXFLUSH_MASK				( MML_UART_CR_RXFLUSH_MASK_NOOFST << MML_UART_CR_RXFLUSH_OFST ) //!< RXFLUSH mask

#define MML_UART_CR_SIZE_OFST					10 //!< SIZE offset
#define MML_UART_CR_SIZE_MASK_NOOFST			0x3 //!< SIZE mask no offset
#define MML_UART_CR_SIZE_MASK					( MML_UART_CR_SIZE_MASK_NOOFST << MML_UART_CR_SIZE_OFST ) //!< SIZE mask

#define MML_UART_CR_STOP_OFST					12 //!< STOP offset
#define MML_UART_CR_STOP_MASK_NOOFST			0x1 //!< STOP mask no offset
#define MML_UART_CR_STOP_MASK					( MML_UART_CR_STOP_MASK_NOOFST << MML_UART_CR_STOP_OFST ) //!< STOP mask

#define MML_UART_CR_RTSCTS_OFST					13 //!< CTSRTS offset
#define MML_UART_CR_RTSCTS_MASK_NOOFST			0x1 //!< CTSRTS mask no offset
#define MML_UART_CR_RTSCTS_MASK					( MML_UART_CR_RTSCTS_MASK_NOOFST << MML_UART_CR_RTSCTS_OFST ) //!< CTSRTS mask

#define MML_UART_CR_RFU2_OFST					14 //!< RFU2 offset
#define MML_UART_CR_RFU2_MASK_NOOFST			0x3ffff //!< RFU2 mask no offset
#define MML_UART_CR_RFU2_MASK					( MML_UART_CR_RFU2_MASK_NOOFST << MML_UART_CR_RFU2_OFST ) //!< RFU2 mask

/** Enumeration of the different value for a bits field . We recommend to use human readable value. */
#define MML_UART_CR_PAREN_DISABLE				0 //!< no parity bit
#define MML_UART_CR_PAREN_ENABLE				1 //!< one parity bit

#define MML_UART_CR_PAREO_ODD					1 //!< odd parity
#define MML_UART_CR_PAREO_EVEN					0 //!< even parity

#define MML_UART_CR_PARMD_O						1 //!< parity based on the number of 0s
#define MML_UART_CR_PARMD_1						0 //!< parity based on the number of 1s

