quanguoheme/hdx_1.1/drivers/max3255X/include/dev/mml_uart_regs.h
#define MML_UART_CR_TXFLUSH_FLUSH				1 //!< flush TX FIFO

#define MML_UART_CR_RXFLUSH_FLUSH				1 //!< flush RX FIFO

#define MML_UART_CR_SIZE_5						0 //!< 5-bit data format
#define MML_UART_CR_SIZE_6						1 //!< 6-bit data format
#define MML_UART_CR_SIZE_7						2 //!< 7-bit data format
#define MML_UART_CR_SIZE_8						3 //!< 8-bit data format

#define MML_UART_CR_RTSCTS_DISABLE				0 //!< hardware flow control disable
#define MML_UART_CR_RTSCTS_ENABLE				1 //!< hardware flow control enable

/** @} */ /* @defgroup MML_UART_REGS_CR */


/** @defgroup MML_UART_REGS_SR Status Register (SR)
 *
 * @li TXBUSY [0]	- R: UART is transmitting data
 * @li RXBUSY [1] 	- R: UART is receiving data
 * @li RFU1 [2]		- R: reserved
 * @li RXEMPTY [6]	- R: RX FIFO empty flag
 * @li RXFULL [6]	- R: TX FIFO full flag
 * @li TXEMPTY [7]	- R: TX FIFO empty flag
 * @li TXFULL [6]	- R: TX FIFO full flag
 * @li RXELT [7]	- R: number of element in RX FIFO
 * @li TXELT [6]	- R: number of element in TX FIFO
 * @li RFU2 [31:16]	- R: reserved
 *
 * @{
 */
#define MML_UART_SR_OFST						0x00000004 //!< Register offset
#define MML_UART_SR_DFLT						0x00000050 //!< Register default value

/** Bits Fields */
#define MML_UART_SR_TXBUSY_OFST					0 //!< TXBUSY offset
#define MML_UART_SR_TXBUSY_MASK_NOOFST			0x1 //!< TXBUSY mask no offset
#define MML_UART_SR_TXBUSY_MASK					( MML_UART_SR_TXBUSY_MASK_NOOFST << MML_UART_SR_TXBUSY_OFST ) //!< TXBUSY mask

#define MML_UART_SR_RXBUSY_OFST					1 //!< RXBUSY offset
#define MML_UART_SR_RXBUSY_MASK_NOOFST			0x1 //!< RXBUSY mask no offset
#define MML_UART_SR_RXBUSY_MASK					( MML_UART_SR_RXBUSY_MASK_NOOFST << MML_UART_SR_RXBUSY_OFST ) //!< RXBUSY mask

#define MML_UART_SR_RFU1_OFST					2 //!< RFU1 offset
#define MML_UART_SR_RFU1_MASK_NOOFST			0x3 //!< RFU1 mask no offset
#define MML_UART_SR_RFU1_MASK					( MML_UART_SR_RFU1_MASK_NOOFST << MML_UART_SR_RFU1_OFST ) //!< RFU1 mask

#define MML_UART_SR_RXEMPTY_OFST				4 //!< RXEMPTY offset
#define MML_UART_SR_RXEMPTY_MASK_NOOFST			0x1 //!< RXEMPTY mask no offset
#define MML_UART_SR_RXEMPTY_MASK				( MML_UART_SR_RXEMPTY_MASK_NOOFST << MML_UART_SR_RXEMPTY_OFST ) //!< RXEMPTY mask

#define MML_UART_SR_RXFULL_OFST					5 //!< RXFULL offset
#define MML_UART_SR_RXFULL_MASK_NOOFST			0x1 //!< RXFULL mask no offset
#define MML_UART_SR_RXFULL_MASK					( MML_UART_SR_RXFULL_MASK_NOOFST << MML_UART_SR_RXFULL_OFST ) //!< RXFULL mask

#define MML_UART_SR_TXEMPTY_OFST				6 //!< TXEMPTY offset
#define MML_UART_SR_TXEMPTY_MASK_NOOFST			0x1 //!< TXEMPTY mask no offset
#define MML_UART_SR_TXEMPTY_MASK				( MML_UART_SR_TXEMPTY_MASK_NOOFST << MML_UART_SR_TXEMPTY_OFST ) //!< TXEMPTY mask

#define MML_UART_SR_TXFULL_OFST					7 //!< TXFULL offset
#define MML_UART_SR_TXFULL_MASK_NOOFST			0x1 //!< TXFULL mask no offset
#define MML_UART_SR_TXFULL_MASK					( MML_UART_SR_TXFULL_MASK_NOOFST << MML_UART_SR_TXFULL_OFST ) //!< TXFULL mask

#define MML_UART_SR_RXELT_OFST					8 //!< RXELT offset
#define MML_UART_SR_RXELT_MASK_NOOFST			0xf //!< RXELT mask no offset
#define MML_UART_SR_RXELT_MASK					( MML_UART_SR_RXELT_MASK_NOOFST << MML_UART_SR_RXELT_OFST ) //!< RXELT mask

#define MML_UART_SR_TXELT_OFST					12 //!< TXELT offset
#define MML_UART_SR_TXELT_MASK_NOOFST			0xf //!< TXELT mask no offset
#define MML_UART_SR_TXELT_MASK					( MML_UART_SR_TXELT_MASK_NOOFST << MML_UART_SR_TXELT_OFST ) //!< TXELT mask

#define MML_UART_SR_RFU2_OFST					16 //!< RFU2 offset
#define MML_UART_SR_RFU2_MASK_NOOFST			0xffff //!< RFU2 mask no offset
#define MML_UART_SR_RFU2_MASK					( MML_UART_SR_RFU2_MASK_NOOFST << MML_UART_SR_RFU2_OFST ) //!< RFU2 mask

#define MML_UART_SR_TX_BUSY						1 //!< UART is transmitting data
#define MML_UART_SR_RX_BUSY						1 //!< UART is receiving data
#define MML_UART_SR_RX_EMPTY					1 //!< RX FIFO is empty
#define MML_UART_SR_RX_FULL						1 //!< RX FIFO is full
#define MML_UART_SR_TX_EMPTY					1 //!< TX FIFO is empty
#define MML_UART_SR_TX_FULL						1 //!< TX FIFO is full

#define MML_UART_STATUS_TX_BUSY					( MML_UART_SR_TX_BUSY << MML_UART_SR_TXBUSY_OFST ) /** UART is transmitting data */
#define MML_UART_STATUS_RX_BUSY					( MML_UART_SR_RX_BUSY << MML_UART_SR_RXBUSY_OFST ) /** UART is receiving data */
#define MML_UART_STATUS_RX_EMPTY				( MML_UART_SR_RX_EMPTY << MML_UART_SR_RXEMPTY_OFST ) /** RX FIFO is empty */
#define MML_UART_STATUS_RX_FULL					( MML_UART_SR_RX_FULL << MML_UART_SR_RXFULL_OFST ) /** RX FIFO is full */
#define MML_UART_STATUS_TX_EMPTY				( MML_UART_SR_TX_EMPTY << MML_UART_SR_TXEMPTY_OFST ) /** TX FIFO is empty */
#define MML_UART_STATUS_TX_FULL					( MML_UART_SR_TX_FULL << MML_UART_SR_TXFULL_OFST ) /** TX FIFO is full */
#define MML_UART_DATA_RX_PARITY					( 0x01 << MML_UART_SR_RXELT_OFST ) /** parity error occurred during the byte reception */

#define	MML_UART_BRR_DIV_FACTOR					128
#define	MML_UART_RCR_DDIV_FACTOR				128

#define MML_UART_BAUD_RATE_MASK_IDIV			0x00000fff
#define MML_UART_BAUD_RATE_MASK_DDIV			0x0000007f
#define MML_UART_CTL_TRANSFER_SIZE_MASK			( 0x03 << MML_UART_CR_SIZE_OFST )

#define	MML_UARTx_GPIO_CFG_MASK_NOOFST			0xf

#define	MML_UART0_GPIO_CFG_OFFSET				8
#define	MML_UART0_GPIO_CFG_MASK					( MML_UARTx_GPIO_CFG_MASK_NOOFST << MML_UART0_GPIO_CFG_OFFSET )

#define	MML_UART1_GPIO_CFG_OFFSET				12
#define	MML_UART1_GPIO_CFG_MASK					( MML_UARTx_GPIO_CFG_MASK_NOOFST << MML_UART1_GPIO_CFG_OFFSET )

#define	MML_UART2_GPIO_CFG_OFFSET				14
#define	MML_UART2_GPIO_CFG_MASK					( MML_UARTx_GPIO_CFG_MASK_NOOFST << MML_UART2_GPIO_CFG_OFFSET )

#define	MML_UARTx_GPIO_RXD						0x1
#define	MML_UARTx_GPIO_TXD						0x2
#define	MML_UARTx_GPIO_RTS						0x4
#define	MML_UARTx_GPIO_CTS						0x8


/** @} */ /* @defgroup MML_UART_REGS_SR */


/** @defgroup MML_UART_REGS_IER Interrupt Enable Register (IER)
 *
 * @li FRAMIE [0]	- R/W: framing error interrupt flag
 * @li PARIE [1] 	- R/W: parity error interrupt flag
 * @li SIGIE [2]	- R/W: CTS line toggling interrupt flag
 * @li OVERIE [3]	- R/W: overrun on receiving interrupt flag
 * @li FFRXIE [4]	- R/W: RX FIFO threshold interrupt flag
 * @li FFTXOIE [5]	- R/W: TX FIFO last byte interrupt flag
 * @li FFTXHIE [6]	- R/W: TX FIFO half level interrupt flag
 * @li RFU [31:7]	- R: reserved
 *
 * @{
 */
#define MML_UART_IER_OFST						0x00000008 //!< Register offset
#define MML_UART_IER_DFLT						0x00000000 //!< Register default value

/** Bits Fields */
#define MML_UART_IER_FRAMIE_OFST				0 //!< FRAMIE offset
#define MML_UART_IER_FRAMIE_MASK_NOOFST			0x1 //!< FRAMIE mask no offset
#define MML_UART_IER_FRAMIE_MASK				( MML_UART_IER_FRAMIE_MASK_NOOFST << MML_UART_IER_FRAMIE_OFST ) //!< FRAMIE mask

#define MML_UART_IER_PARIE_OFST					1 //!< PARIE offset
#define MML_UART_IER_PARIE_MASK_NOOFST			0x1 //!< PARIE mask no offset
#define MML_UART_IER_PARIE_MASK					( MML_UART_IER_PARIE_MASK_NOOFST << MML_UART_IER_PARIE_OFST ) //!< PARIE mask

#define MML_UART_IER_SIGIE_OFST					2 //!< SIGIE offset
#define MML_UART_IER_SIGIE_MASK_NOOFST			0x1 //!< SIGIE mask no offset
#define MML_UART_IER_SIGIE_MASK					( MML_UART_IER_SIGIE_MASK_NOOFST << MML_UART_IER_SIGIE_OFST ) //!< SIGIE mask

#define MML_UART_IER_OVERIE_OFST				3 //!< OVERIE offset
#define MML_UART_IER_OVERIE_MASK_NOOFST			0x1 //!< OVERIE mask no offset
#define MML_UART_IER_OVERIE_MASK				( MML_UART_IER_OVERIE_MASK_NOOFST << MML_UART_IER_OVERIE_OFST ) //!< OVERIE mask

#define MML_UART_IER_FFRXIE_OFST				4 //!< FFRXIE offset
#define MML_UART_IER_FFRXIE_MASK_NOOFST			0x1 //!< FFRXIE mask no offset
#define MML_UART_IER_FFRXIE_MASK				( MML_UART_IER_FFRXIE_MASK_NOOFST << MML_UART_IER_FFRXIE_OFST ) //!< FFRXIE mask

