quanguoheme/hdx_1.1/drivers/max3255X/include/dev/mml_uart_regs.h
#define MML_UART_IER_FFTXOIE_OFST				5 //!< FFTXOIE offset
#define MML_UART_IER_FFTXOIE_MASK_NOOFST		0x1 //!< FFTXOIE mask no offset
#define MML_UART_IER_FFTXOIE_MASK				( MML_UART_IER_FFTXOIE_MASK_NOOFST << MML_UART_IER_FFTXOIE_OFST ) //!< FFTXOIE mask

#define MML_UART_IER_FFTXHIE_OFST				6 //!< FFTXHIE offset
#define MML_UART_IER_FFTXHIE_MASK_NOOFST		0x1 //!< FFTXHIE mask no offset
#define MML_UART_IER_FFTXHIE_MASK				( MML_UART_IER_FFTXHIE_MASK_NOOFST << MML_UART_IER_FFTXHIE_OFST ) //!< FFTXHIE mask

#define MML_UART_IER_RFU_OFST					7//!< RFU offset
#define MML_UART_IER_RFU_MASK_NOOFST			0x1ffffff //!< RFU mask no offset
#define MML_UART_IER_RFU_MASK					( MML_UART_IER_RFU_MASK_NOOFST << MML_UART_IER_RFU_OFST ) //!< RFU mask

#define MML_UART_IER_FRAMIE_DISABLE				0 //!< framing error interrupt disable
#define MML_UART_IER_FRAMIE_ENABLE				1 //!< framing error interrupt enable

#define MML_UART_IER_PARIE_DISABLE				1 //!< parity error interrupt disable
#define MML_UART_IER_PARIE_ENABLE				1 //!< parity error interrupt enable

#define MML_UART_IER_SIGIE_DISABlE				0 //!< CTS changed interrupt disable
#define MML_UART_IER_SIGIE_ENABlE				1 //!< CTS changed interrupt enable

#define MML_UART_IER_OVERIE_DISABLE				0 //!< overrun interrupt disable
#define MML_UART_IER_OVERIE_ENABLE				1 //!< overrun interrupt enable

#define MML_UART_IER_FFRXIE_DISABLE				0 //!< RX FIFO threshold interrupt disable
#define MML_UART_IER_FFRXIE_ENABLE				1 //!< RX FIFO threshold interrupt enable

#define MML_UART_IER_FFTXOIE_DISABLE			0 //!< TX FIFO last byte interrupt disable
#define MML_UART_IER_FFTXOIE_ENABLE				1 //!< TX FIFO last byte interrupt enable

#define MML_UART_IER_FFTXHIE_DISABLE			0 //!< TX FIFO half filled interrupt disable
#define MML_UART_IER_FFTXHIE_ENABLE				1 //!< TX FIFO half filled interrupt enable

/** @} */ /* @defgroup MML_UART_REGS_IER */


/** @defgroup MML_UART_REGS_ISR Interrupt Status Register (ISR)
 *
 * @li FRAMIS [0]	- R/C: framing error interrupt flag
 * @li PARIS [1] 	- R/C: parity error interrupt flag
 * @li SIGIS [2]	- R/C: CTS line toggling interrupt flag
 * @li OVERIS [3]	- R/C: overrun on receiving interrupt flag
 * @li FFRXIS [4]	- R/C: RX FIFO threshold interrupt flag
 * @li FFTXOIS [5]	- R/C: TX FIFO last byte interrupt flag
 * @li FFTXHIS [6]	- R/C: TX FIFO half level interrupt flag
 * @li RFU [31:7]	- R: reserved
 *
 * @{
 */
#define MML_UART_ISR_OFST						0x0000000c //!< Register offset
#define MML_UART_ISR_DFLT						0x00000000 //!< Register default value

/** Bits Fields */
#define MML_UART_ISR_FRAMIS_OFST				0 //!< FRAMIS offset
#define MML_UART_ISR_FRAMIS_MASK_NOOFST			0x1 //!< FRAMIS mask no offset
#define MML_UART_ISR_FRAMIS_MASK				( MML_UART_ISR_FRAMIS_MASK_NOOFST << MML_UART_ISR_FRAMIS_OFST ) //!< FRAMIS mask

#define MML_UART_ISR_PARIS_OFST					1 //!< PARIS offset
#define MML_UART_ISR_PARIS_MASK_NOOFST			0x1 //!< PARIS mask no offset
#define MML_UART_ISR_PARIS_MASK					( MML_UART_ISR_PARIS_MASK_NOOFST << MML_UART_ISR_PARIS_OFST ) //!< PARIS mask

#define MML_UART_ISR_SIGIS_OFST					2 //!< SIGIS offset
#define MML_UART_ISR_SIGIS_MASK_NOOFST			0x1 //!< SIGIS mask no offset
#define MML_UART_ISR_SIGIS_MASK					( MML_UART_ISR_SIGIS_MASK_NOOFST << MML_UART_ISR_SIGIS_OFST ) //!< SIGIS mask

#define MML_UART_ISR_OVERIS_OFST				3 //!< OVERIS offset
#define MML_UART_ISR_OVERIS_MASK_NOOFST			0x1 //!< OVERIS mask no offset
#define MML_UART_ISR_OVERIS_MASK				( MML_UART_ISR_OVERIS_MASK_NOOFST << MML_UART_ISR_OVERIS_OFST ) //!< OVERIS mask

#define MML_UART_ISR_FFRXIS_OFST				4 //!< FFRXIS offset
#define MML_UART_ISR_FFRXIS_MASK_NOOFST			0x1 //!< FFRXIS mask no offset
#define MML_UART_ISR_FFRXIS_MASK				( MML_UART_ISR_FFRXIS_MASK_NOOFST << MML_UART_ISR_FFRXIS_OFST ) //!< FFRXIS mask

#define MML_UART_ISR_FFTXOIS_OFST				5 //!< FFTXOIS offset
#define MML_UART_ISR_FFTXOIS_MASK_NOOFST		0x1 //!< FFTXOIS mask no offset
#define MML_UART_ISR_FFTXOIS_MASK				( MML_UART_ISR_FFTXOIS_MASK_NOOFST << MML_UART_ISR_FFTXOIS_OFST ) //!< FFTXOIS mask

#define MML_UART_ISR_FFTXHIS_OFST				6 //!< FFTXHIS offset
#define MML_UART_ISR_FFTXHIS_MASK_NOOFST		0x1 //!< FFTXHIS mask no offset
#define MML_UART_ISR_FFTXHIS_MASK				( MML_UART_ISR_FFTXHIS_MASK_NOOFST << MML_UART_ISR_FFTXHIS_OFST ) //!< FFTXHIS mask

#define MML_UART_ISR_RFU_OFST					7 //!< RFU offset
#define MML_UART_ISR_RFU_MASK_NOOFST			0x1ffffff //!< RFU mask no offset
#define MML_UART_ISR_RFU_MASK					( MML_UART_ISR_RFU_MASK_NOOFST << MML_UART_ISR_RFU_OFST ) //!< RFU mask

#define MML_UART_ISR_FRAMIS_ERROR				1 //!< framing error
#define MML_UART_ISR_PARIS_ERROR				1 //!< parity error
#define MML_UART_ISR_SIGIS_TOGGLING				1 //!< CTS changed
#define MML_UART_ISR_OVERIS_ERROR				1 //!< OVERIS error
#define MML_UART_ISR_FFRXIS_THRESHOLD			1 //!< RX FIFO threshold reached
#define MML_UART_ISR_FFTXOIS_ONE				1 //!< TX FIFO last byte
#define MML_UART_ISR_FFTXHIS_HALF				1 //!< TX FIFO half filled

/** @} */ /* @defgroup MML_UART_REGS_ISR */


/** @defgroup MML_UART_REGS_BRR0 Baud Rate Register 0 (BRR0)
 *
 * @li IDIV [11:0]	- R/W: integer divider
 * @li RFU [31:12]	- R: reserved
 *
 * @{
 */
#define MML_UART_BRR_OFST						0x00000010 //!< Register offset
#define MML_UART_BRR_DFLT						0x00000000 //!< Register default value

/** Bits Fields */
#define MML_UART_BRR_IDIV_OFST					0 //!< IDIV offset
#define MML_UART_BRR_IDIV_MASK_NOOFST			0xfff //!< IDIV mask no offset
#define MML_UART_BRR_IDIV_MASK					( MML_UART_BRR_IDIV_MASK_NOOFST << MML_UART_BRR_IDIV_OFST ) //!< IDIV mask

#define MML_UART_BRR_RFU_OFST					12 //!< RFU offset
#define MML_UART_BRR_RFU_MASK_NOOFST			0xfffff //!< RFU mask no offset
#define MML_UART_BRR_RFU_MASK					( MML_UART_BRR_RFU_MASK_NOOFST << MML_UART_BRR_RFU_OFST ) //!< RFU mask

/** @} */ /* @defgroup MML_UART_REGS_BRR0 */


/** @defgroup MML_UART_REGS_BBR1 Baud Rate Register 1 (BRR1)
 *
 * @li DDIV [6:0]	- R/W: decimal divider
 * @li RFU [31:7]	- R: reserved
 *
 * @{
 */
#define MML_UART_BRR1_OFST						0x00000014 //!< Register offset
#define MML_UART_BRR1_DFLT						0x00000000 //!< Register default value

/** Bits Fields */
#define MML_UART_BRR1_IDIV_OFST					0 //!< DDIV offset
#define MML_UART_BRR1_IDIV_MASK_NOOFST			0x7f //!< DDIV mask no offset
#define MML_UART_BRR1_IDIV_MASK					( MML_UART_BRR1_IDIV_MASK_NOOFST << MML_UART_BRR1_IDIV_OFST ) //!< DDIV mask

#define MML_UART_BRR1_RFU_OFST					7 //!< RFU offset
#define MML_UART_BRR1_RFU_MASK_NOOFST			0x1ffffff //!< RFU mask no offset
#define MML_UART_BRR1_RFU_MASK					( MML_UART_BRR1_RFU_MASK_NOOFST << MML_UART_BRR1_RFU_OFST ) //!< RFU mask

/** @} */ /* @defgroup MML_UART_REGS_BRR1 */


/** @defgroup MML_UART_REGS_TXR Transmit Register (TXR)
 *
 * @li DATA [7:0]	- R/W: TX data read out (for debug purpose)
 * @li RFU [31:8]	- R: reserved
 *
 * @{
 */
#define MML_UART_TXR_OFST						0x18 //!< Register offset
#define MML_UART_TXR_DFLT						0x0 //!< Register default value

/** Bits Fields */
#define MML_UART_TXR_DATA_OFST					0 //!< DATA offset
#define MML_UART_TXR_DATA_MASK_NOOFST			0xff //!< DATA mask no offset
#define MML_UART_TXR_DATA_MASK					( MML_UART_TXR_DATA_MASK_NOOFST << MML_UART_TXR_DATA_OFST ) //!< DATA mask

