quanguoheme/hdx_1.1/drivers/max3255X/include/dev/mml_uart_regs.h
#define MML_UART_TXR_RFU_OFST					8 //!< RFU offset
#define MML_UART_TXR_RFU_MASK_NOOFST			0xffffff //!< RFU mask no offset
#define MML_UART_TXR_RFU_MASK					( MML_UART_TXR_RFU_MASK_NOOFST << MML_UART_TXR_RFU_OFST ) //!< RFU mask

/** @} */ /* @defgroup MML_UART_REGS_TXR */


/** @defgroup MML_UART_REGS_PR Pins Register (PR)
 *
 * @li CTS [0]		- R: CTS pin status
 * @li CTS [1]		- R/W: RTS pin control
 * @li RFU [31:2]	- R: reserved
 *
 * @{
 */
#define MML_UART_PR_OFST						0x1c //!< Register offset
#define MML_UART_PR_DFLT						0x3 //!< Register default value

/** Bits Fields */
#define MML_UART_PR_CTS_OFST					0 //!< CTS offset
#define MML_UART_PR_CTS_MASK_NOOFST				0x1 //!< CTS mask no offset
#define MML_UART_PR_CTS_MASK					( MML_UART_PR_CTS_MASK_NOOFST << MML_UART_PR_CTS_OFST ) //!< CTS mask

#define MML_UART_PR_RTS_OFST					1 //!< RTS offset
#define MML_UART_PR_RTS_MASK_NOOFST				0x1 //!< RTS mask no offset
#define MML_UART_PR_RTS_MASK					( MML_UART_PR_RTS_MASK_NOOFST << MML_UART_PR_RTS_OFST ) //!< RTS mask

#define MML_UART_PR_RFU_OFST					2 //!< RFU offset
#define MML_UART_PR_RFU_MASK_NOOFST				0x3fffffff //!< RFU mask no offset
#define MML_UART_PR_RFU_MASK					( MML_UART_PR_RFU_MASK_NOOFST << MML_UART_PR_RFU_OFST ) //!< RFU mask

/** @} */ /* @defgroup MML_UART_REGS_PR */


/** @defgroup MML_UART_REGS_DR Data Register (DR)
 *
 * @li DATA [7:0]	- R/W: RX/TX data
 * @li PARITY [8]	- R/W: RX data parity
 * @li RFU [31:9]	- R: reserved
 *
 * @{
 */
#define MML_UART_DR_OFST						0x20 //!< Register offset
#define MML_UART_DR_DFLT						0x0 //!< Register default value

/** Bits Fields */
#define MML_UART_DR_DATA_OFST					0 //!< DATA offset
#define MML_UART_DR_DATA_MASK_NOOFST			0xff //!< DATA mask no offset
#define MML_UART_DR_DATA_MASK					( MML_UART_DR_DATA_MASK_NOOFST << MML_UART_DR_DATA_OFST ) //!< DATA mask

#define MML_UART_DR_PARITY_OFST					8 //!< PARITY offset
#define MML_UART_DR_PARITY_MASK_NOOFST			0x1 //!< PARITY mask no offset
#define MML_UART_DR_PARITY_MASK					( MML_UART_DR_PARITY_MASK_NOOFST << MML_UART_DR_PARITY_OFST ) //!< PARITY mask

#define MML_UART_DR_RFU_OFST					2 //!< RFU offset
#define MML_UART_DR_RFU_MASK_NOOFST				0x7fffff//!< RFU mask no offset
#define MML_UART_DR_RFU_MASK					( MML_UART_DR_RFU_MASK_NOOFST << MML_UART_DR_RFU_OFST )//!< RFU mask

/** @} */ /* @defgroup MML_UART_REGS_DR */

/** @defgroup MML_UART_REGS_DMA DMA Register (DMA)
 *
 * @li TXCNT [3:0]	- R/W: TX threshold
 * @li TXEN  [4]        - R/W: TX channel enable
 * @li RXCNT [8:5]	- R/W: RX threshold
 * @li RXEN  [9]        - R/W: RX channel enable
 * @li RFU   [31:10]	- R: reserved
 *
 * @{
 */

#define MML_UART_DMA_OFST						0x30 //!< Register offset
#define MML_UART_DMA_DFLT						0x0 //!< Register default value

/* Bits Fields */

#define MML_UART_DMA_TXCNT_OFST					0 //!< TXCNT offset
#define MML_UART_DMA_TXCNT_MASK_NOOFST			0xf //!< TXCNT mask no offset
#define MML_UART_DMA_TXCNT_MASK					( MML_UART_DMA_TXCNT_MASK_NOOFST << MML_UART_DMA_TXCNT_OFST ) //!< TXCNT mask


#define MML_UART_DMA_TXEN_OFST					4 //!< TXEN offset
#define MML_UART_DMA_TXEN_MASK_NOOFST			0x1 //!< TXEN mask no offset
#define MML_UART_DMA_TXEN_MASK					( MML_UART_DMA_TXEN_MASK_NOOFST << MML_UART_DMA_TXEN_OFST ) //!< TXEN mask

#define MML_UART_DMA_RXCNT_OFST					5 //!< RXCNT offset
#define MML_UART_DMA_RXCNT_MASK_NOOFST			0xf //!< RXCNT mask no offset
#define MML_UART_DMA_RXCNT_MASK					( MML_UART_DMA_RXCNT_MASK_NOOFST << MML_UART_DMA_RXCNT_OFST ) //!< RXCNT mask

#define MML_UART_DMA_RXEN_OFST					9	//!< RXEN offset
#define MML_UART_DMA_RXEN_MASK_NOOFST			0x1 //!< RXEN mask no offset
#define MML_UART_DMA_RXEN_MASK					( MML_UART_DMA_RXEN_MASK_NOOFST << MML_UART_DMA_RXEN_OFST ) //!< RXEN mask

#define MML_UART_DMA_RFU_MASK					0xfffffc00 //!< RFU mask

/** @} */ /* @defgroup MML_UART_REGS_DMA */


#ifndef __ASSEMBLER__
/* -------------------------------------------------------------------------- */
/** UART Registers.
 *
 */
typedef volatile struct
{
	 /** Control register */
	volatile unsigned int						cr;
	/** Status register */
	volatile unsigned int						sr;
	/** Interrupt enable register */
	volatile unsigned int						ier;
	/** Interrupt status register */
	volatile unsigned int						isr;
	/** Baudrate register 0 */
	volatile unsigned int						brr;
	/** Baudrate register 1 */
	volatile unsigned int						rcr;
	/** TX register */
	volatile unsigned int						txr;
	/** Pin register */
	volatile unsigned int						pnr;
	/** Data register */
	volatile unsigned int						dr;
	/**  */
	volatile unsigned int						rfu[3];
	/** DMA */
	volatile unsigned int						dma;

} mml_uart_regs_t;

#endif /* __ASSEMBLER__ */

/** @} */ /* @defgroup MML_UART_REGS */

#endif /* _MML_UART_REGS_H_ */

/******************************************************************************/
/* EOF */
